[
  {
    "post_id": "1br4wgb",
    "title": "Do not post questions about college admissions, college decisions, or specific universities here.",
    "body": "Go to the university subreddit or /r/applyingtocollege",
    "category": "Other",
    "severity_score": 24.6,
    "severity_level": "Medium",
    "score": 123,
    "num_comments": 0,
    "created_utc": 1711760298.0,
    "top_comments": []
  },
  {
    "post_id": "1q0cumq",
    "title": "Thinking of switching from a 4 year university to community college for dental hygiene, looking for advice.",
    "body": "Hello yall, I’m currently a sophomore at a 4-year university majoring in Biology. I’ve got about a 3.1 GPA and 47 completed credits right now, and I’m taking 13 credits this spring to bring me close to 60. Most of what I’ve taken so far are gen eds.\n\nI originally planned to go to dental school and become a dentist, but I’ve realized how competitive, time consuming, stressful, and expensive that path is. I’m not sure if that lifestyle is realistically what I want anymore.\n\nI’ve been seriously thinking about switching directions and becoming a dental hygienist instead. The problem is my university doesn’t offer anything related to dental hygiene, so I’d likely need to switch to a community college program. I *think* some of my credits will transfer, but I’m not totally sure. I’ll be talking to an advisor after break to figure that out.\n\nRight now I’m registered for Calc 1 and Gen Chem 2, but those wouldn’t really matter for a dental hygiene program. I could swap into A&amp;P, which I would need, but part of me feels like sticking toward my bachelor’s is the “safer” option in case I change my mind again.\n\nI also keep hearing mixed things about dental hygiene, some people say it’s a great, stable, good paying job, while others say hygienists burn out and end up switching careers. I’m worried that if I go the associate’s route I’ll feel “stuck,” and would need to go back later for a bachelor’s if I ever wanted to pivot. At the same time, part of me still likes the idea of dentistry, but with my GPA, not much shadowing yet, and not many extracurriculars, I don’t feel confident in that path right now. I do plan to get shadowing hours this summer though.\n\nBasically, I’m really lost and don’t know what to commit to. Is switching from a university to community college for dental hygiene actually worth it? Does having “just” an associate’s really hold people back long-term? Or is finishing a bachelor’s the smarter route even if I’m unsure?\n\nIf you’ve been in a similar situation or work in dentistry, I’d really appreciate honest advice.\n\nTL;DR: Sophomore bio major at a 4-year with a 3.1 GPA and around 47 credits. Taking 13 credits this spring semester to reach about 60. Debating whether to stay and finish a bachelor’s or switch to community college for dental hygiene. Worried about job satisfaction, credit transfer, and getting “stuck” with an associate’s.",
    "category": "Mental Health",
    "severity_score": 6.4,
    "severity_level": "Low",
    "score": 1,
    "num_comments": 7,
    "created_utc": 1767187205.0,
    "top_comments": [
      {
        "comment_text": "I'd say do the swap. A bachelor's in bio doesn't have many high paying jobs after you graduate. Get the dental hygiene degree and start working. if you wanna go back to get a bachelor's after, you can do that. and you'll even have a good extracurricular if you choose to continue pursuing dentistry",
        "comment_score": 11
      },
      {
        "comment_text": "I can't contribute much to you... but I hope you can elaborate a little more for me. I'm where you are but behind you (freshman) and am curious about this, the dentistry path/dream, a little more. Is it that tough?",
        "comment_score": 3
      },
      {
        "comment_text": "Definitely agree on checking into what credits will transfer. I was kinda on the same path as you but with pharmacy, I was initially in the pre pharm program my school offered but ultimately decided to declare a biology major. I was on the fence for pharm(same reason you stated) and didn’t wanna put all my eggs in one basket in the event I didn’t like the path.  I’d say make the switch if you’ve thought it over enough. That way if you do decide to go back to dentistry you’ll have the grades and experience to help you stand out. \n\nFor the dental hygiene path, have you talked to any hygienist in person or just on Reddit? If it’s like the pharmacy sub then it can turn into an echo chamber of doom and gloom. Try talking to multiple hygienist and dentist in person, get a feel for what they’re experiencing in the community.",
        "comment_score": 3
      }
    ]
  },
  {
    "post_id": "1pzja8q",
    "title": "Is going to a less prestigious school better than a prestigious school just to save money?",
    "body": "I’m a HS senior trying to figure out what college is right for me. I was looking a local 4 year institution in my city (georgia southern at Armstrong). The reason i would want to go there is to save and commute. It would be great to graduate with less debt if i plan to go to medical school. \n\nMy dad is pushing me to go to uga because it’s more prestigious than georgia southern. Uga is an amazing school but i never felt like i would thrive or fit in. I want to love the school but i feel like it isn’t for me. Maybe it’s the fact i could be so scared to feel suffocated by ultra competitive people again. I don’t know. or maybe it’s the fact im too scared to face the fact i’ll probably get rejected and i’m not smart enough to go there. Both of my parents are willing to pay for my attendance to uga if i were to get accepted but i can’t help but feel suffocated to the idea of me even going there. \n\nI feel called to medicine but if i were to get rejected from uga i would think i wasn’t smart enough to even go into medicine. Maybe you can tell my deepest insecurity is not being smart. \n\nI think i feel like i would fit in at georgia southern because its smaller and i think i would do better in a closer environment than a huge college. anyways, i would love some advice or a personal experience! ",
    "category": "Financial",
    "severity_score": 43.0,
    "severity_level": "High",
    "score": 37,
    "num_comments": 39,
    "created_utc": 1767104373.0,
    "top_comments": [
      {
        "comment_text": "Pick the option that lets you graduate with the least amount of debt. You’ll def be going into debt for medical school so it would be prudent to save money now if possible.",
        "comment_score": 92
      },
      {
        "comment_text": "I flourished by going to a smaller school.\nNot only was it cheaper but the classes were smaller and I felt like I could fit in and actually get to know people.\n\nI'm a biology major and I never thought I'd be a science major because I had awful grades in high school. But by going to a small college, I learned confidence and have the ability to ask for help from professors- who love to talk with me after class because they aren't swamped.\n\n\nMy sister is going to a prestigious school and she's also getting a science major but she's going to be in so much more debt. Still, we've both had great opportunities for internships, grants, ect.\n\nIt really doesn't matter where you graduate from, it just matters that you're competent and you try.",
        "comment_score": 17
      },
      {
        "comment_text": "Go to a prestigious school if they offer you a scholarship. If they don't, go to a cheaper school. Unless your dad is paying for your schooling, you need to make your own financial decisions. ",
        "comment_score": 8
      }
    ]
  },
  {
    "post_id": "1pyvkjp",
    "title": "Parental advices Needed - Pre-Law",
    "body": "My daughter wants to pursue a law degree. My wife and I are both public educators and solidly middle class. What guidance can you give us to help steer her through this? \n\nFor instance, if you came from a middle class family (enough to not qualify for grants but not enough to be able to foot the bill), how did you navigate the finances of it all?\n\nMy daughter is a fantastic student but not going to be a valedictorian-type student. High GPA, top 10 in a 350 kid senior class, solid score on the act but not perfect,etc. A great kid but isn’t getting a full ride anywhere.\n\nI grew up incredibly poor, went to school on grants, and am now a 20+ year public educator. I have a bachelor and two masters but I feel out of my element when guiding her through this process.\n\nWhat is your undergrad in? What kind of debt should we be comfortable with? What did you do that worked? What didn’t? Is she going to find work?!?\n\nI’m freaking out here! Haha\n\nAny advice for a parent trying to help their daughter ?!?",
    "category": "Academic",
    "severity_score": 14.2,
    "severity_level": "Medium",
    "score": 21,
    "num_comments": 10,
    "created_utc": 1767036439.0,
    "top_comments": [
      {
        "comment_text": "College admissions consultant here.\n\nStudents interested in pursuing law can major in anything for undergrad. Many students pick majors like political science, government, or public policy, but there’s no required major or classes for undergrad — any major that develops your critical thinking skills, reading comprehension, analytical skills, and logic will help. Majoring in philosophy, English, economics, Classics, psychology, history, sociology, etc. would all work. Some students hoping to pursue patent law even major in science or engineering subjects. Some colleges offer niche majors or minors for particular interests, like environmental policy, human rights law, criminal justice, etc.\n\nFor law careers, where you attend law school matters much more than your undergrad institution. Obviously some undergrad colleges offer more opportunities than others, but it’s possible to reach law school from nearly any undergrad college if you do well there.\n\nLaw school admissions are based on undergrad GPA, LSAT scores, and experience in internships, work, etc. Students with high enough stats can potentially win scholarships for law school. Some scholarships are specifically reserved for students pursuing “public interest” law and are contingent on a certain number of years in those jobs after graduation. The r/lawschooladmissions sub is very active and has some useful information!\n\nThe amount of debt that families and students feel willing to take on really varies. Some students take on substantial debt for law school, assuming that they’ll be able to pay it off with a corporate law career. However, taking on debt is obviously stressful and can constrain your choices. \n\nIf your daughter is hoping for financial aid and merit scholarships during undergrad, she can keep that in mind when building a college list. Some colleges tend to be more generous with aid and scholarships than others, and students will typically get more merit scholarships at colleges where they’d be a standout student (so perhaps taking a step down in selectivity, applying to more “targets” and “safeties”). A handful of highly-selective colleges do guarantee to meet 100% of financial need with grants (financial aid) to middle-class families making $70-250k, so depending on your family finances and your daughter’s applicant profile some financial aid grants might even be possible.\n\nWhile many people know the obvious pre-law heavy hitters like Yale and Georgetown, there are plenty of colleges that punch above their weight with preparing their undergrads for good law schools. Some of my favorite colleges for students pursuing law (with admit rates above 10%) are Haverford (12% admit rate), Wellesley (14% admit rate), Wesleyan (17%), Vassar (19%), Colgate (14%), Carleton (20%), William &amp; Mary (34%), Bryn Mawr (29%), Oberlin (34%), Brandeis (40%), and American (62%).",
        "comment_score": 21
      },
      {
        "comment_text": "Highly recommend looking into a 3 + 3 program. Combines undergrad + a JD in only 6 years. \n\nPersonally come from a lower middle class family, had a family member start me a 529 plan which pretty much covered undergrad, but not enough for law school. I dropped out of high school and had a GED so wasn't sure what my options would be. \n\nEnrolled at a 3 + 3 program through a state university. Undergrad, I didn't live on campus, I didn't have a meal plan or student housing, and also in-state tuition. Made my undergrad tuition feel like pennies by not paying an extra $6k to live on campus and have the school's food service.   \n  \nMy undergrad was in political science, so I had a lot of opportunities that were funded by the school (scholarships, grants) that were specific to my field. Did a couple study abroad programs that were international policy centered and those got me an extra semester of credits and were covered by scholarship money. Didn't have to have a crazy high GPA to participate either. \n\nThat being said, that was able to get some extra credits and I was able to knock almost an entire year off my undergrad. So went from 6 total years to a JD, to 5 and saved some money.\n\nAlso in undergrad, I aimed for a 4.0 and spent over a year studying for the LSAT. Was able to get a lot of scholarship offers for nearly every law school I applied for that way, including T14 schools. \n\nWalked out with 0 debt. \n\nI think the 529 helped a lot with undergrad, but I would've likely had some debt had I not done any of the study abroad programs. Overall though, going with a state school for undergrad, I estimated I would've had to take out about $22k give or take in loans had I not had the 529 or study abroad scholarships.\n\nAlso as far as finding work, I was able to get a scholarship that guaranteed me a spot in the public defender's office for 3 years after passing the bar. \n\nIf she really wants to go to law school, there are a lot of options that can make that happen, but it absolutely is challenging and there is a lot of self-determination involved. She's really gotta be prepared to put the work in.",
        "comment_score": 7
      },
      {
        "comment_text": "I went to state universities for bachelors and first masters and felt quite lost at the time my daughter began applying for colleges. I was surprised to learn that small liberal arts colleges considered our family income to be low enough that she received substantially lower family expected contributions from them than public schools. Luckily, she really liked the small college atmosphere.  I am a single parent that has two jobs—one paying about the same as a teacher, maybe a little less, and then a part-time job that pays about 20K.  I would guess my income is only a little lower than 2 teachers earn.  She had 4 offers that had 0 loans and me paying less than 10K per year.  You can do it. Just run those price estimators for the colleges that look good. She ended up picking the one that was the lowest cost to me, though I said any of those 4 were manageable….not easy, but manageable. She has 0 debt and I have 0 debt. (It took me close to 20 years to pay off my own loans from college!)All of the money is need-based. She had lower stats than your daughter, but ended up at a highly ranked SLAC.  I hope she finds some great schools, and that you don’t find the experience too onerous.  You’ve already heard that all you need for law school is a good liberal arts education and strong LSATs. You really can’t go wrong, so long as she finds a place that will mentor her with great writing, arguing and critical thinking skills (and time to study like crazy for the LSAT.)",
        "comment_score": 2
      }
    ]
  },
  {
    "post_id": "1pwn7tr",
    "title": "Is there anything wrong with quitting college after I get my associate's degree?",
    "body": "Honestly, the entire time I was in high school I thought I would enjoy college, and spend 4 years getting a bachelor's. But now that I'm in my last semester of community college, I realized that this isn't for me anymore. Every day I have to go to school just feels like a miserable slog. I don't pay attention much in class, and just do the absolute bare minimum to get an A.\n\nMy scholarships have dried up, and if I leave after my next semester, I can graduate debt-free with a 3.9 GPA. My parents have no issue with me doing this, either. I really want to quit while I'm ahead.\n\nAm I making a mistake by doing this? Does an associate's count as a real degree? Just not sure how to feel about it right now, all I know is I can't do another 2 years of this.",
    "category": "Financial",
    "severity_score": 56.0,
    "severity_level": "High",
    "score": 78,
    "num_comments": 51,
    "created_utc": 1766805323.0,
    "top_comments": [
      {
        "comment_text": "I think it’s more limited in terms of jobs than a bachelors but if you find a job with your new degree more power to you",
        "comment_score": 125
      },
      {
        "comment_text": "You gotta do what's going to be the best for you. I don't see a problem with your situation and wanting to stop after the associates. Does it always get you as far as a bachelors or masters? No, but if you're unsure of what you want to do with furthering your education, even taking a break for a few semesters or few years could be beneficial if you decide to go back later. Or even if you decide not to go back, that's fine too.",
        "comment_score": 47
      },
      {
        "comment_text": "Long-term, you'd be better off with a university degree than just a community college one, but it's ultimately your call.",
        "comment_score": 26
      }
    ]
  },
  {
    "post_id": "1px86ud",
    "title": "Student loans",
    "body": "I’m a senior in highschool and a biological science major trying to decide where I want to go, and even though my mom has told me not to worry about the cost and make the choice based on what I want because she will deal with loans, I don’t want to have that financial burden on me and my family. Especially since I have two younger siblings. I have heard nothing but horrible things about student loans and student loan forgiveness/assistance under this administration is a nightmare and I don’t want to have to worry about if that’s something I might need. At the same time I have worked so hard and believe I should be able to choose a college based on what I want while also factoring in the amount i might have to take out in loans. I would feel more comfortable with the idea of loans if interest wasn’t a thing because it seems like a complete nightmare. I also know that plenty of people have student loan debt and it isn’t the end of the world to have a student loan payment. I don’t necessarily even know what I’m asking but I would love any kind of advice or consolation about taking the route of student loans if I don’t choose to go somewhere that can be payed out of pocket. This also might be a hard question to answer since it would vary in every situation but what is a usual/comfortable amount to take out in loans for college? Any advice is greatly appreciated.",
    "category": "Financial",
    "severity_score": 8.6,
    "severity_level": "Low",
    "score": 2,
    "num_comments": 11,
    "created_utc": 1766868510.0,
    "top_comments": [
      {
        "comment_text": "It sounds like you don't really know what you want. It might be worth considering either:\n\n1. Taking a gap year; or\n2. Going to your local community college after graduation, taking transferrable general education credits at a substantially lower cost, and *then* transferring to your preferred school. These courses would be taught by a grad assistant anyway, so honestly you might have a *better* educational experience going this route.",
        "comment_score": 10
      },
      {
        "comment_text": "I would consider attending a Community College if cost is one of your primary concerns. Right now I'm working on a degree in Engineering at my local community college and working so although I've taken 80+ credits, I'm completely debt free, have saved a decent amount of money, and have a great working history to add to my resume. Once I transfer to a university I'll probably have to take out loans but they'll be half of what they would have been if I went straight into it.",
        "comment_score": 6
      },
      {
        "comment_text": "If you are serious about getting into the biological sciences field, you will likely need a Master's degree at the least, and probably a PhD.  Given that, by the time you are looking for a job, the only college on your resume that matters is the place where you got the Masters/PhD.  So... save the money on the undergrad tuition.  If you can get a relevant degree from an inexpensive school, hold a high college GPA and do well on the MCAT/GRE, you will be able to get offers from grad top schools and work through that school on scholarships and TA jobs.  \n\nCheck out this Government site: https://collegescorecard.ed.gov/. It lets you find relevant, inexpensive schools that you can consider.  Note that lots of out of state schools offer scholarships that make the cost comparable to your state's tuition.  (Be sure to complete the FAFSA forms - https://studentaid.gov/fafsa-apply/colleges) If your family's income is low, come from a poor state (i.e., MS/AL/LA/OK), and you have good test scores, you will have lots of good options.  Check out this site (https://www.bestcollegeguide.com/) is you need help narrowing it down.",
        "comment_score": 3
      }
    ]
  },
  {
    "post_id": "1pwhdq8",
    "title": "Fasfa SAI question",
    "body": "Ok so for the 2026-2027 fasfa I got a 2600 score on my SAI but usually I get a -1500. Does this mean i’m not getting a refund? I need those refunds to pay for books, food and rent. I don’t understand what was different this year compared to last year.. Does this also mean I have to pay for some of my tuition?? usually i’d get between 1.7k-2.3k back in refunds but does this mean I won’t get anything? I’m mostly just stressed out about this.",
    "category": "Financial",
    "severity_score": 8.0,
    "severity_level": "Low",
    "score": 5,
    "num_comments": 10,
    "created_utc": 1766789221.0,
    "top_comments": [
      {
        "comment_text": "Your SAI going up usually means you'll receive less Pell grant funding. You might still receive a refund, but it won't be as much as it was before.",
        "comment_score": 12
      },
      {
        "comment_text": "It doesn’t mean you won’t get *anything*, but you will likely get less than if your score is -1500.",
        "comment_score": 2
      },
      {
        "comment_text": "Are you dependent (a parent has to also complete FAFSA) or independent?\n\nThe change in SAI suggests that there was an income change from 2023 to 2024. It might be yours or a parent's.",
        "comment_score": 1
      }
    ]
  },
  {
    "post_id": "1pw6sed",
    "title": "Taking a semester off due to finances. Need advice on how to use the time well.",
    "body": "Hey everyone, I’m a freshman in college (CS major) who may not be able to return next semester due to financial issues. I’m still hoping something works out, but I’m trying to be realistic and prepare in case I need to take some time away from school. In a way it’s kind of my fault because I went to college right out of high school and decided to go to a 4 year knowing that my family isn’t doing great financially. I’ve had help from some family members and FASFA but it wasn’t enough.\n\nThis isn’t something I want, and I’m not giving up on college long-term. I’ve really enjoyed my time here, especially being involved in student organizations, and I want to put myself in the best position to come back and not have this issue again. \n\nIf I do end up stepping away for a semester (or longer), I’m trying to figure out what the smartest way to use that time would be. Right now I’m thinking about focusing on things like working, getting reliable transportation, and building skills. \n\nFor anyone who’s been in a similar situation whether you took time off, transferred, worked before coming back, or changed plans entirely what helped you the most during that period? What do you wish you had done differently? Are there things you’d recommend prioritizing or avoiding?\n\nI’d really appreciate any responses \n\nThanks ",
    "category": "Academic",
    "severity_score": 17.2,
    "severity_level": "Medium",
    "score": 20,
    "num_comments": 17,
    "created_utc": 1766762673.0,
    "top_comments": [
      {
        "comment_text": "\\&gt;it’s kind of my fault \n\nIt's not your fault at all. I'm proud of you for going to college, despite a difficult home financial situation.\n\nOP - work. Work hard for the next 9 months. Do as immigrants do - be diligent and frugal. Save up as much money as you can. \n\nAlso research other financing options - scholarships, grants, loans, campus work-study, etc. \n\nIn your free time, keep up lightly with reviewing the schoolwork from this past year. Then go back Sept 2026. \n\nGood luck.",
        "comment_score": 23
      },
      {
        "comment_text": "While you’re out, look up modernstates.org and CLEP exams. Depending on your school, you can transfer in up to 60 credits. I had to leave school due to financial issues for a few years until I could apply for school as a completely tax-independent person to get full funding. I wish I had looked into the CLEP exams during that time. My school only accepts about half of the CLEP exams that are available. I’m set to graduate this spring. I have two associate degrees. CLEP exams can be anywhere from $25 to free using the link I provided for $100 per test. You could study at your own pace. As soon as you pass those courses, you can transfer them in so that you’re still making progress toward your degree.",
        "comment_score": 6
      },
      {
        "comment_text": "r/CLEP\nThere are ways to still earn college credits for way cheaper/for free through CLEP exams (Collegeboard), using modern states. Depends on if your college accepts them though\n\nEdit: oops! Someone already beat me too it. Best of luck OP",
        "comment_score": 3
      }
    ]
  },
  {
    "post_id": "1pueejh",
    "title": "Professional internship requires academic credit, but I don’t have a class that fits—what are my options?",
    "body": "Hi all,\n\nI’ve been offered a professional internship that requires me to receive college credit to participate. The problem is, I don’t currently have a course in my program that applies to this opportunity. Has anyone successfully navigated this situation? Any strategies or examples would be super helpful.\n\nThanks in advance!",
    "category": "Academic",
    "severity_score": 24.4,
    "severity_level": "Medium",
    "score": 34,
    "num_comments": 6,
    "created_utc": 1766550420.0,
    "top_comments": [
      {
        "comment_text": "I suggest emailing your advisor",
        "comment_score": 41
      },
      {
        "comment_text": "+1 to asking your advisor or your department head. Either will have almost certainly dealt with a similar scenario of some sort. Most likely they have a course you aren’t aware of that works for awarding credit for internships, solo/guided research, etc. or they can put it in as a special topics somehow.",
        "comment_score": 26
      },
      {
        "comment_text": "Colleges will often have a class setup that is for Independent study or experience. Just as everyone else has mentioned, you're going to want to talk to either your academic advisor or to the head of your program.",
        "comment_score": 9
      }
    ]
  },
  {
    "post_id": "1pu19wu",
    "title": "Academic Dismissal to Graduation? Looking for success stories and advice on reapplying.",
    "body": "I was recently dismissed from university due to grades. I’m viewing this as a necessary wake-up call and I am currently in the process of fixing my life so I can reapply and finish what I started. I’m motivated, not discouraged.\n\nThe only thing nagging at me is the comparison game. I know everyone runs their own race, but seeing friends graduate while I’m dealing with this setback is tough.\n\nIf you graduated significantly later than your peer group, does it actually matter in the long run? Looking for some success stories or mindset shifts to help me focus on my own path rather than looking at everyone else's.",
    "category": "Academic",
    "severity_score": 20.0,
    "severity_level": "Medium",
    "score": 50,
    "num_comments": 25,
    "created_utc": 1766514512.0,
    "top_comments": []
  },
  {
    "post_id": "1pubzci",
    "title": "Lower Level Electives",
    "body": "I've recently gotten a credit evaluation at the university I want to transfer to so I can know which courses will transfer and what their equivalent course are but some courses are listed as lower elective and when I got the credit evaluation back some courses were listed as lower elective and I'm confused what it means. Will the courses still count towards the degree or would I have to take a higher-level course at the university I will be transferring to?",
    "category": "Academic",
    "severity_score": 2.6,
    "severity_level": "Low",
    "score": 5,
    "num_comments": 4,
    "created_utc": 1766542888.0,
    "top_comments": []
  },
  {
    "post_id": "1ptpa1b",
    "title": "How do I get money to live off of during college? Loans? I’m just confused",
    "body": "First generation student. My dad left money to pay for my college before dying but it ran out last semester. I have about 7500 offered via federal loans and I have 5500 of tuition left over after scholarships for the spring so that would only leave 2000 of that loan to live off of. I can’t really work tremendously because I’m taking 17 credits and my school hours (MWF 9-3 and TTH 9-5) make me undesirable for jobs. I have an on campus job that I am now only schedule for 2 hours next semester (weekly) 😬 and I’m going to try to look for a weekend job if I can find one. But how do I get more money for living expenses? Do federal loans give more? How do I do that? My mom and I are really lost and overwhelmed. Private loans? Those scare me, our bank does sally Mae and she wants to go there and I’m not sure. I just want to do my best to have living expenses paid for the spring and I’m not sure what to do. ",
    "category": "Financial",
    "severity_score": 57.4,
    "severity_level": "High",
    "score": 123,
    "num_comments": 82,
    "created_utc": 1766480229.0,
    "top_comments": []
  },
  {
    "post_id": "1pu0oqz",
    "title": "How to deal with unfair workload in group assignments?",
    "body": "I’m in my last year now and this year is when most of the assignments are done by group. From the two year, I have been in different assignments groups, but somehow since third year I have stuck with the almost the same group of people. We ended up being good friends, the type of friends I never had during high school.\n\nHowever, I’m currently feeling pretty overwhelmed by this group. No one ever assign me as the team leader but somehow I look like one. The things I have to do (no one tell me to do it, but if I don’t, we won’t have anything to submit): \n\n•the idea/topics are mostly decided by me( they barely give any ideas)\n•set up the group meeting/discussion \n•dividing the workload, who should do which part\n•solve the problem, if they can’t find/do something they will expect me to do it\n•present the draft or idea in the class\n\nAnd here’s my problem with the team: \n•they are always late, sometimes up to 4 hours late (even though in my country being late is not that serious but this is too much)\n•sometimes they absent without telling me \n•some member barely reply me in the group, even though sometimes I ask \n\nMy group has six peoples btw.\n\nSometimes I question if I’m too strict or too much? I feel like they are so chill while I’m stressing about the assignment. What should I do? I’m feeling so overwhelmed right now. ",
    "category": "Academic",
    "severity_score": 4.8,
    "severity_level": "Low",
    "score": 8,
    "num_comments": 8,
    "created_utc": 1766513102.0,
    "top_comments": []
  },
  {
    "post_id": "1ptov04",
    "title": "The pressure is getting to me..",
    "body": "I am currently in my first year at a four-year university after I got my associates degree in community college. I'm majoring in marine biology because it was my passion coming out of high school, but lately I have felt in such a slump.\n\nI was so happy to finish this past semester and go home for the holidays, but my anxiety has been getting to me ever since I got back about how badly I don't want to return to school. I don't dislike school at all, but I'm slowly realizing how much I hate my current university, the city it's in, and I don't want to study my major anymore. \n\nI want to switch my major and switch my school, but I don't have the slightest idea what I would want to study instead. I only have about 3 weeks to decide what I'm going to do before my spring semester tuition is due, so I'm really limited on time. I'm also renting an apartment with my roommate and will have to return to it regardless. I'm just feeling so incredibly lost and stressed and upset. I have been looking at medical laboratory science, but I'm worried that I won't actually enjoy it as much as I'm convincing myself I will. My parents really want me to get a degree, and I'm a first-gen student, and it's slowly eating me alive. Any advice would be so helpful right now, and thank you in advance.",
    "category": "Housing",
    "severity_score": 5.0,
    "severity_level": "Low",
    "score": 13,
    "num_comments": 6,
    "created_utc": 1766478600.0,
    "top_comments": []
  },
  {
    "post_id": "1ptmgul",
    "title": "How to confront feeling of too much information?",
    "body": "I feel like the more I learn, the less I know. Like with the Dunning Kruger effect, but I don't ever feel like the percent of knowledge I know ever increases. It's like the more I learn info from classes, the more I feel like there's an ever expanding sea of information that I don't know. Every answer leads to 10 more questions. I think it's the most pronounced in the area I want to study (physics). Will I ever feel like I know enough to actually make a difference? Will I ever actually \"get\" physics?\n\nI swear, this feeling gets worse with every google search and people answering on stack overflow with equations I don't know yet",
    "category": "Academic",
    "severity_score": 2.0,
    "severity_level": "Low",
    "score": 4,
    "num_comments": 3,
    "created_utc": 1766469830.0,
    "top_comments": []
  },
  {
    "post_id": "1przvhs",
    "title": "Final semester hold – first-gen student $20k short and out of options",
    "body": "Hi everyone,\nI’m posting here because I’m honestly out of ideas and running out of time.\n\nI’m a first-generation college student, and I’m one semester away from graduating. Fall 2025 left me with a $20,000 financial hold on my student account, and until that’s paid, I can’t enroll for Spring 2026, which is my final semester before graduation.\n\nI’ve done everything I know how to do:\n\t•\tMet with financial aid multiple times\n\t•\tTalked to student accounting\n\t•\tWent to the dean and other offices\n\t•\tLooked into every loan option available to me\n\nI’ve already maxed out my federal student loans, used up my savings to get this far, and my parents are not in a position to help. The only suggestion I keep getting is “take out more loans,” which I literally can’t do. I’m currently working, but there’s no realistic way for me to come up with $20k before Spring semester starts. It’s really hard knowing I’m this close to finishing my degree and might be stopped at the finish line because of money.\n\nI’m not posting this expecting miracles, but I’m hoping for:\n\t•\tAdvice from anyone who’s been in a similar situation\n\t•\tResources, programs, or ideas I might not know about\n\t•\tOr, if anyone is willing to help in any way (donations, leads, guidance), I would be incredibly grateful\n\nThis degree means everything to me. I’ve worked for years to get here, and I just want the chance to finish what I started.\n\nThank you for reading, even if all you have is advice.\n\nTLDR: I’m a first-generation college student one semester away from graduating, but I have a $20k financial hold from Fall 2025 that I must pay before I can enroll in Spring 2026. I’ve maxed out student loans, used all my savings, my parents can’t help, and I’ve already gone to financial aid, student accounting, and the dean. I’m working but can’t realistically cover $20k in time and I’m looking for advice, resources, or any possible help so I can finish my degree.",
    "category": "Financial",
    "severity_score": 34.8,
    "severity_level": "High",
    "score": 98,
    "num_comments": 38,
    "created_utc": 1766298771.0,
    "top_comments": []
  },
  {
    "post_id": "1pr1lmp",
    "title": "Should I reply to a professors email?",
    "body": "My history professor emailed me recently congratulating me for my exceptional work on the final and how he makes it a habit to reach out to students who do. He wished me a good break and how he looked forward to seeing me next semester and was happy to meet w me if I was considering a history minor or major. Am I expected to reply? Like is it over the top to send a reply email? What’s the standard I’m confused 😭",
    "category": "Academic",
    "severity_score": 37.8,
    "severity_level": "High",
    "score": 137,
    "num_comments": 26,
    "created_utc": 1766192980.0,
    "top_comments": []
  },
  {
    "post_id": "1pqvkbf",
    "title": "So I’ll be moving 2 1/2 hours away from home next fall. just want some insight so I can have a semi smooth transition",
    "body": "Any advice on getting acclimated? I won’t have a car but I’ll be getting an e-bike for trips around the area im planning on staying at. Im a little concerned. Idk much to do with moving away. What would I actually need? Etc just any advice thats not discouraging helps\n\nPs: keep the comments friendly",
    "category": "Other",
    "severity_score": 5.2,
    "severity_level": "Low",
    "score": 10,
    "num_comments": 8,
    "created_utc": 1766176347.0,
    "top_comments": []
  },
  {
    "post_id": "1pq50ec",
    "title": "Should I get an apartment near campus or get a dorm?",
    "body": "Hello everyone,\n\nI’m currently a sophomore in college, and I’ve been debating a big decision about my living situation. Right now, I still live at home and commute to campus, but I’ve been considering whether I should get my own place closer to school or wait until I can apply for a dorm.\n\nI’ve heard a lot of mixed opinions about dorm life: some people say it’s amazing if you end up with good roommates and a solid floor community, and others say it can be terrible if you get unlucky. But one thing I consistently hear is that dorms make it so much easier to meet people, make friends, and just be in the middle of campus life. My freshman year wasn’t bad at all, I made friends, got involved a little bit, and even dated someone for a while but looking back, I feel like I didn’t fully take advantage of what that first year could’ve been. I feel like I could’ve been more social, done more things on campus, and just built a stronger network.\n\nNow that I’m a sophomore, I really want to push myself out of my comfort zone and create more memories. I want to make more friends, meet new people, and honestly, meet more girls and have a more active social life. I don’t want college to just be lectures, assignments, and going home right after class. I want to feel like I’m actually in college.\n\nThe problem is, I missed the housing application deadline for sophomore year, so I can’t get into a dorm until junior year at the earliest. My options right now are either:\n\n1. Get an apartment near campus this year, which would give me my own space, but I’m not sure if it would help with meeting people, since I’ve heard that off-campus living can sometimes feel isolating unless you already have a big friend group.\n2. Stay commuting for sophomore year and apply to live in a dorm junior year, hoping that it’s not too late to get the social experience I’m looking for.\n\nSo I’m kind of stuck. Part of me thinks getting an apartment near campus might still help because I’d be physically closer to events, clubs, and people. But another part of me feels like dorm life is where most friendships and social circles are naturally formed, and I might be missing out by not experiencing it sooner.\n\nIf anyone has gone through something similar, I’d really appreciate your perspective. Is living in a dorm actually a game changer for social life? Or is living off campus still good enough if I make a solid effort to get involved? I just don’t want to look back and feel like I wasted the best years of my life by being too disconnected.\n\nThanks in advance for any advice. I’m trying to make the best choice for my social life, personal growth, and overall college experience.",
    "category": "Housing",
    "severity_score": 4.6,
    "severity_level": "Low",
    "score": 7,
    "num_comments": 8,
    "created_utc": 1766098804.0,
    "top_comments": []
  },
  {
    "post_id": "1pp9qdj",
    "title": "Roommate or no roommate?",
    "body": "Having gotten to the time where I’m choosing on-campus living arrangements, I’m really at a crossroads right now.\n\nFor a while now, I’ve wanted to have the typical experience of having a roommate, but the longer I think about it the more I wonder if I should just bite the bullet on price and go for not sharing a room. I have really bad anxiety about doing stuff in front of people, specifically around just general necessary-to-live things. Leaving to go to the bathroom, blowing my nose, eating, breathing, rolling over in bed, etc etc. \n\nSo all of that in front of a person I’m going to be in the same room with for an extended amount of time has been stressing me out, especially since I have this problem that makes me physically unable handle certain noises along with mental junk that’s just general embarrassing yo deal with in front of others.\n\nI really want to get past this and believe that eventually I’d be able to be comfortable and handle myself, but I also don’t want to be stressed out 24/7. Any advice?",
    "category": "Mental Health",
    "severity_score": 8.6,
    "severity_level": "Low",
    "score": 13,
    "num_comments": 15,
    "created_utc": 1766009496.0,
    "top_comments": []
  },
  {
    "post_id": "1pnu62y",
    "title": "how to network with professors without being weird?",
    "body": "I want to network and make more friends, and I'm sure I've heard that professors can be a great networking opportunity, but I'm not sure if there's any etiquette behind it?\n\nthere are two professors I've had this past semester that stand out to me as being really nice and beneficial to network with.  one is a creative writing masters student (I'm getting a bachelors in creative writing) and the other was my composition professor (she's tailored to the business department, but teaches english composition classes, and is also just so sweet).\n\nis there an appropriate way for me to stay in contact with them without weirding them out?\n\nI'm making a point to at least wait until all grades are submitted.  would it be weird to invite them out for coffee to chat after break, or email them asking them questions, or even just have a general chat?  would it be weird to make a friend-relationship with them?\n\nmaybe this sounds silly and I'm overthinking this all, but I've been out of college for 6 years due to mental health and getting back into an academic environment, as thrilled as I am, is also intimidating socially\n\nwould love to hear any professors experiences with being approached by students outside of class, too!",
    "category": "Academic",
    "severity_score": 16.4,
    "severity_level": "Medium",
    "score": 56,
    "num_comments": 13,
    "created_utc": 1765863593.0,
    "top_comments": []
  },
  {
    "post_id": "1pn46hv",
    "title": "Office hours",
    "body": "I know the purpose of office hours is that students get help with the class, whether that’s homework or any questions we may have, but are office hours generally agreed to also allow for students to talk to the professor just for the sake of conversation? Could be about the content in class or even just to get to know them?",
    "category": "Academic",
    "severity_score": 18.4,
    "severity_level": "Medium",
    "score": 62,
    "num_comments": 15,
    "created_utc": 1765794713.0,
    "top_comments": []
  },
  {
    "post_id": "1pmz0yb",
    "title": "When to give a student a car?",
    "body": "**Tl;Dr: Daughter wants a car. Mom thinks she would benefit from learning to depend on others. Daughter wants independence. What do?**   \n  \nI'll start by saying I'm very fortunate and grateful to be in the position I am to provide for my kids education 100% out of pocket. I did not go to college, but still ended up in a lucrative career which I've persisted with for almost 3 decades in various industries which has made me well rounded and useful to my employers. A heaping helping of benefitting from white privilege along the way. That said...\n\nMy daughter is begging for a car. She's a freshman this year. She wants a car next year. I'm borderline ambivalent at the moment, leaning toward getting her one... maybe. She has an internship this summer, unpaid, will not need a car but it will give her valuable experience in her target industry and will be certain to land a paying job next summer.  \n  \nMy daughter is mortally afraid of talking to other people and will do almost anything to avoid human interaction. Her dormmate moved out b/c she is a party girl and my daughter is boring and liked to go to bed early. My daughter attends most of her classes and is a solid B student. Does not party. Ever. Very responsible, if somewhat over-thinking individual, and perpetually anxious. \n\nMy wife's argument against the car purchase amounts to the growth opportunity our daughter is experiencing having to rely on others. Something that moves her out of her comfort zone and forces her to interact with people. Build empathy, etc.\n\nMy daughter's arguments for the car amount to being able to invite others to go places and do things instead of being a burden to others. Also, she got ill during the semester and while she didn't die, she called home after a severe allergic reaction where her throat had swollen tight and could barely breathe, asking mom for ideas on what to do about it without interacting with others. Basically, she seriously would risk death instead of being a burden to people. She claims if she had a car she would have sought medical help sooner. There's even odds that statement is true in my opinion.\n\nI know she's a nutjob, but that's what college is for. Learning how to press yourself into the world. Find your way, etc. We've told her to seek mental health with mixed results. She's seeing the school counselor irregularly about this and other phobias... that's not the point of this post. \n\nThe central question is this: Do I buy her a (used) car? ",
    "category": "Academic",
    "severity_score": 57.2,
    "severity_level": "High",
    "score": 110,
    "num_comments": 88,
    "created_utc": 1765774833.0,
    "top_comments": []
  },
  {
    "post_id": "1pmmc5p",
    "title": "Is it common for professors to become friends with students after the semester?",
    "body": "This is my first time encountering a professor who likes to keep in touch with students. Last week was our final class meeting, and he said he was open to exchanging contact info with us. When he found out that I'm passionate about a certain topic he's also interested in, he asked if we could meet for coffee sometime. He'd like to discuss the topic further, since technically we ran out of time to talk (some students had important questions). \n\nHe also said he's willing to give me some books from his personal library, regarding that topic. Apparently he doesn't need them anymore. \n\nIs it common for professors to be this friendly around former students? Also, is it common for professors to ask for insight from former students, to help improve their class material? (He said that maybe I can recommend him some books/documentaries for his class.)\n\nAs a side note, my professor never made me feel pressured to meet up. However, he did make me feel \"smart,\" if that makes sense. As if my knowledge on the topic really matters to him. Then again, he acts like this with every student. ",
    "category": "Academic",
    "severity_score": 44.6,
    "severity_level": "High",
    "score": 127,
    "num_comments": 48,
    "created_utc": 1765739770.0,
    "top_comments": []
  },
  {
    "post_id": "1pm9x81",
    "title": "How do I become more extroverted and make friends in college if I’m shy?",
    "body": "I’m currently in my 3rd semester and from my 4th semester starting in january, i really want to change myself. I want to become more extroverted,make new friends, go out more and actually enjoy my college life.\n\nThe problem is i’m naturally shy and quiet and because of that i overthink a lot and hesitate to start a conversation or join groups. I do have some friends but i want to expand my circle and stop feeling left out.\n\nI don’t want to completely change who i am but i just want to be more confident , social and comfortable around people and also want to participate in new things without hesitation.\n\nI want advice from people who managed to become more outgoing in college.",
    "category": "Housing",
    "severity_score": 29.8,
    "severity_level": "High",
    "score": 81,
    "num_comments": 34,
    "created_utc": 1765703882.0,
    "top_comments": []
  },
  {
    "post_id": "1pmjvjq",
    "title": "Can names be changed after publication?",
    "body": "I'm an undergraduate in college in the US and I have a handful of publications going out soon. I also really hate my last name. It's a pain, it's not phonetic, and I have some issues with the family who gave it to me so I've been looking forward to changing it and was planning on doing so when I got married. \n\nExcept I'm not in a relationship at all, so I can't change my name soon and the publications have been accepted. When I do change my name, will I be able to change it on the electronic versions of the publications? Obviously for stuff in print it'll be too late. ",
    "category": "Other",
    "severity_score": 5.4,
    "severity_level": "Low",
    "score": 13,
    "num_comments": 7,
    "created_utc": 1765733800.0,
    "top_comments": []
  },
  {
    "post_id": "1pkliso",
    "title": "Associate of Science vs. Associate of General Studies",
    "body": "  \nI’m currently in a dual-enrollment/early-college program and trying to decide between graduating with an Associate of Science (AS) or an Associate of General Studies (AGS).\n\nMy long-term goal is to major in Mechanical Engineering after finishing high school/college credit requirements, so I want to pick the degree that will be the most versatile, transferable, and aligned with engineering prerequisites.\n\nFrom what I understand:  \nAS seems more structured toward STEM, but I’m not sure how consistent that is across colleges.  \nAGS seems more flexible, but I’m worried universities might not take it as seriously, or I might not transfer as well for an engineering path.\n\nFor anyone who has gone through dual enrollment or transferred into an engineering major from an associate's degree/CC which degree would be more beneficial and transferable?  \nIs there a significant difference in how universities view AS vs. AGS for STEM majors?\n\nAny insight or personal experience would help a ton. Thanks!",
    "category": "Housing",
    "severity_score": 10.4,
    "severity_level": "Medium",
    "score": 38,
    "num_comments": 7,
    "created_utc": 1765522897.0,
    "top_comments": []
  },
  {
    "post_id": "1pkfihh",
    "title": "Using real or preferred name for student ID",
    "body": "I’ve never liked my name so I decided to change it before starting college. My school lets you use a preferred name on student IDs, but I’m wondering if anyone who has done this has had any issues; such as someone wanting verification from a drivers license and it not matching.\n\n**edit** there were too many comments to reply to, but thank you to everyone who gave advice! It was super helpful. ",
    "category": "Other",
    "severity_score": 19.2,
    "severity_level": "Medium",
    "score": 58,
    "num_comments": 19,
    "created_utc": 1765504351.0,
    "top_comments": []
  },
  {
    "post_id": "1pk0z9r",
    "title": "Failing a Class: Where do I go from here?",
    "body": "This semester has been hell. I transferred to my current school two years ago, and also switched majors when I transferred. I enjoy what I’m doing, and want to finish out schooling and get my degree. With my degree switch, as well as transferring to another school, I would have been put behind by a semester.\n\nTo account for this, I took 3 in-program courses in one semester. I’m in Comp. Sci, the classes in question are Data Structures, Computer Architecture, and Programming languages. At my school, these are some of the hardest in major courses. I got sick early on in the semester and got overwhelmed quickly. My first round of exams didn’t go well, and I ended up withdrawing from Computer Architecture. Based on how I’ve been doing in the other two courses, I’m going to fail Data Structures. I did what I could to damage control and ensure my GPA wouldn’t be completely destroyed, but it’s still going to affect it pretty badly.\n\nWhat do I do going forward? I’ve never failed a class before. I’m putting together a plan for next semester, I want to ask for more help because I know that was something I really struggled with this semester. I’m also trying to be more conscious of what I’m scheduling for, ensuring I won’t be overwhelmed. Is there anything else that I can reasonably do? My attempt to avoid staying for an extra semester is tuning into needing to stay an extra year, and I really don’t know what to do.",
    "category": "Academic",
    "severity_score": 16.2,
    "severity_level": "Medium",
    "score": 31,
    "num_comments": 25,
    "created_utc": 1765468495.0,
    "top_comments": []
  },
  {
    "post_id": "1pjo40p",
    "title": "I want to learn more, but I feel like without college, there isn't an incentive to learn.",
    "body": "I am a physics major with a math minor (i plan on going to grad for EE or e&amp;m). I genuinely love the challenge and stress that school/classes comes with, however I want to learn more, but I feel that without the stress and challenge involved, it is less fun. I just want to see if there is other ways to have a similar feeling to that. I have a linear algebra and dfq book (i haven't taken the classes yet), and i was planning on setting a goal to read the whole books and complete all the questions. However, I still feel like this isn't good enough. I would like suggestions on what i should do that doesn't break my bank account or that is free. Thank y'all :)",
    "category": "Academic",
    "severity_score": 15.0,
    "severity_level": "Medium",
    "score": 59,
    "num_comments": 8,
    "created_utc": 1765426257.0,
    "top_comments": []
  },
  {
    "post_id": "1pi1t01",
    "title": "Mom pressuring me into borrowing subsidized loan to give to her",
    "body": "So I am in my first year of university. \n\nI am disabled (psychologically) and for the past 3 years or so, my mom, a single mother, who is in her early 60s, has not had a real long-term job. Her reasoning being that “she doesn’t want to leave me alone” and I “can’t take care of myself.” I can certainly do that, inadequately at time but I can try. \n\nShe also does not know any basic English either despite being in the states for several years now. \n\nWhat she basically did was that she contacted a government program (in my stead) to hire her to take care of me. She gets some money from this too but she often complains about doing the tasks she is getting paid for. That is the situation since I was 15. \n\nSo currently, I am getting a lot of financial aid refund, mainly because I am staying in our rented home. My mother wants me to borrow extra money on my name. Money borrowed will be subsidized, and basically she wants me to let her “borrow” that money because there is no interest for now.\n\nI told her she probably won’t be able to pay back any of the money because she is already in debt for several thousands dollars, has not had a real job in a long time, and is declining in health. She got really offended, guilt trips (I gave you xxxx for your birthday and high school graduation, why won’t you give me now and raised you), and constantly wants to kick me out. \n\nMy argument was that these are “gifts” so it does not make sense why she is bringing them up as reasons why I should let her borrow the money. That too—all of that was prior to my turning 18 AND she was getting paid from then government to take care of me. Should her reasons even be valid arguments for why I should let her borrow money?\n\nShe mainly needs it for an occasion soon where she will make decent money. But she knows this occasion happens every year—then how come she won’t even try to save it up for it?\n\nA part of me wants to help her but given how she treats me a lot of the time, and her great contributions to my psychological problems, I am very hesitant. \n\nSHOULD I KEEP BORROWING SUBSIDIZED LOAN WITH MY NAME, AND THEN LOAN THAT MONEY TO HER?*\n\n\nUPDATE: \n\nI paid her a fairly large sum of money (at least for me) that should be able to cover for a decent amount of her event soon. \n\nThis sum of money contains electric, phone bill, gas, food, WiFi, etc. THAT covers my portion. \n\nI haven’t really had the time to discuss with her how much I’ll be paying her for things like that since I turned 18 so. \n\nI don’t think she’ll need to borrow me money at this point. \n\nNext quarters I won’t be borrowing subsidized loans anymore! \n\nAbout parent loan PLUS, she doesn’t want to borrow that because she has to pay some interest. Also, dorming is much more expensive compared to me commuting. Theoretically, if I apply for dorm now, there is no guarantee that I can get a single dorm (despite being approved by disability office) due to availability. Staying in a dorm with another person will be a nightmare for them because of my life-long mental health conditions, which are still being treated (likely indefinitely). ",
    "category": "Financial",
    "severity_score": 40.2,
    "severity_level": "High",
    "score": 133,
    "num_comments": 34,
    "created_utc": 1765266924.0,
    "top_comments": []
  },
  {
    "post_id": "1pfq5s8",
    "title": "How do you or what do you use to take notes?",
    "body": "I'm wondering with all of the touch screen technology, how everyone is choosing to take notes now. \n\nAre you still using pen and paper? Are you using a tablet? 2-in-1 computer? ReMarkable or Kindle Scribe type of thing? Typing? \n\nIf you are using technology, what apps or note taking software are you using? \n\nI recently bought an HP Omnibook flip for school and am curious about utilizing it for note taking. My partner just got a Samsung tablet for taking notes and annotating off text books. \n\nFor work I am a mix of pen and paper as well as typing, but I know writing helps me remember and commit to memory over typing my notes. \n\nIt's been 13 years since I've been in school, I want to set myself up for success. What's working for you all?\n",
    "category": "Other",
    "severity_score": 80.0,
    "severity_level": "High",
    "score": 204,
    "num_comments": 135,
    "created_utc": 1765030107.0,
    "top_comments": []
  },
  {
    "post_id": "1pf1bsq",
    "title": "School charging me for classes even though I was never officially registered",
    "body": "So I signed up for classes last year but could not afford them, I applied for a loan and was waiting to hear to see if I got approved. The school told me I needed to enroll in at least 2 classes to receive my loan. Which I did but I couldn't make any sort of payment at all. And this happened way before the deadline which the school will automatically drop you for missing a tuition payment. I ended up not getting approved for my loan and the school apparently did not automatically drop me when I never made any kind of payment. They are now saying I owe them the full amount and took money that I was refunded for something else and put it on the charges. I explained the whole situation to someone in cashiering and she was like oh I can get that dismissed for you no problem. I never received the money  and spoke to someone else and they  told me I have no proof that I never registered and unless I have proof they won't give me my money back. But shouldn't it show in my financial account I never made any payment to register?",
    "category": "Financial",
    "severity_score": 23.2,
    "severity_level": "Medium",
    "score": 66,
    "num_comments": 25,
    "created_utc": 1764956181.0,
    "top_comments": []
  },
  {
    "post_id": "1pemx7w",
    "title": "How do I study?",
    "body": "I am a junior in college studying biochem, and I have the hardest time studying effectively. For classes that I have an easy time in, I don't really need to put much effort into getting an A, but for my more challenging classes, I have no idea how the hell to study. I've tried going to office hours with my professors, but every time I go, their explanations don't make sense, even when I ask them to rephrase what they are saying (same thing if I were to ask them to do the same thing in class).\n\nI try to take notes in class, especially when they provide skeletal notes, but I notice that even when I record the class audio, it doesn't help much. YouTube videos usually don't help much (they do a little, but only so much) because my professors go into way more depth than the YouTubers do. I haven't failed any classes yet, but I have gotten terrible grades in those classes, and I am frustrated and overwhelmed.\n\nI have also done group studying, but it ends up devolving into either us talking about something not even related to the class or everyone doing their own thing while we're just sitting together. Either that, or no one shows up to the study thing.\n\nI also have no idea how to structure notes. I prefer handwriting them because it means I will remember them. I see how study vloggers take notes, but I can't figure out how to structure them so they not only make sense but also include all the necessary information I will need for the class/following exam.",
    "category": "Academic",
    "severity_score": 21.4,
    "severity_level": "Medium",
    "score": 47,
    "num_comments": 30,
    "created_utc": 1764912523.0,
    "top_comments": []
  },
  {
    "post_id": "1pejfxe",
    "title": "What to do after finishing a semester early",
    "body": "As title says, I'm finishing a semester early and graduating this fall. Given the amount of credits from high school and intentional planning, I'm able to graduate early as a biochem major. However, I'm not really sure what I want to do for the next 6 months. I have recently submitted my Fall 2026 PhD applications a few days ago so I have 8 months before I go back to school. Originally, I planned to transition from an undergrad researcher to lab tech but due to funding/grant issues that won't be the case. I want to stay in my college town because of rent/social life/friends so I'm not really sure what to do now and I'm at a loss. Does anyone have any ideas?",
    "category": "Housing",
    "severity_score": 3.8,
    "severity_level": "Low",
    "score": 9,
    "num_comments": 5,
    "created_utc": 1764902054.0,
    "top_comments": []
  },
  {
    "post_id": "1pec7r1",
    "title": "“Support” and “Foundation” Classes Required Alongside Math",
    "body": "Hey all. I had a quick question that I could not find discussed at all online. I go to a community college in CA and have recently started my math requirements. This last math class I took had a required “support” class on a whole other day that I was required to enroll in with the class I wanted to take. I figured it was just a class to go to if we needed help, like an office hour. Nope, it was another day of class, making it a 4 day a week class. The professor told us she couldn’t get through all of the required material with only 3 days. Now I am looking to take the next level, and now have to enroll in a Foundations of Math and Support Math class along with my actual math schedule. Instead of these classes adding a day to a 2 day a week class, they add an hour to 2 two hour classes. Making it two three hour classes instead. Is this the standard or am I losing my mind? I don’t mind doing the time to get my degree but why don’t they just say its a 3 hour class up front? ",
    "category": "Academic",
    "severity_score": 12.8,
    "severity_level": "Medium",
    "score": 20,
    "num_comments": 22,
    "created_utc": 1764883275.0,
    "top_comments": []
  },
  {
    "post_id": "1pdjv21",
    "title": "What do I do if I am unable to find internship",
    "body": "I’m in my first semester senior year and am required to find an internship site for next semester but have been unable to find a site. I’ve been searching since late August when classes started and got a callback from one site who then told me I had the spot, then ghosted me. I spoke with my prof who then told me if i can’t find a site i just won’t graduate on time. This has now started to freak me out because i’ve been telling myself someone will be in contact with me and i’ll have a site soon but the semester is up in w weeks and then the holidays are here and school starts again. i have no clue what to do and no one can help me. my school has contract with certain sites and they gave me the list, just for the sites to either A) tell me i need to be in grad school to be an intern with them or B) just never respond back. I’ve emailed, went into places, calls numerous times, and nothing. Even the place that told me the spot was mines. They just seemed to have disappeared into thin air. and i don’t even have a difficult major. can someone tell me what i should do",
    "category": "Academic",
    "severity_score": 8.2,
    "severity_level": "Low",
    "score": 19,
    "num_comments": 11,
    "created_utc": 1764803947.0,
    "top_comments": []
  },
  {
    "post_id": "1pcl9bv",
    "title": "Do you think that your college grades are subject to grade inflation?",
    "body": "This question inspired by the number of classes I'm in where I'm getting literally an A+ in the class just for turning things in on time and following the guidelines/reading the rubric. I think I'm pretty smart, but I'm not literally the campus genius or anything. \n\nI feel like we talk a lot about grade inflation in college, but usually framed around what we think of the grades other people are getting which they may not deserve. But do you feel like your own grades are over-inflated compared to what you actually deserved?\n\n",
    "category": "Academic",
    "severity_score": 72.8,
    "severity_level": "High",
    "score": 409,
    "num_comments": 82,
    "created_utc": 1764711246.0,
    "top_comments": []
  },
  {
    "post_id": "1pciwqb",
    "title": "Unpaid Internship- should i keep going?",
    "body": "So I'm a junior who just got an unpaid internship, it's completely remote and easy enough. I've only been working for two days, and it's a pretty low-effort job (like I can do homework while also tabbed into teams and the internal system), but I need to log 20 hours per week with 3 hours minimum per day, which I'm now realizing after asking my friends who have had unpaid internships is kinda crazy. I need 240 hours to complete the internship, which is like 12-15 weeks, so i'm going to have to juggle this internship along with my classes and a paid job.\n\nSo my question is, is this worth it? I need to build my resume, but not sure if it's worth all the time i'm committing. Or should I wait it out and give it a few more weeks? I've never quit a job before so I'm not even sure what I would do if i did drop it.",
    "category": "Academic",
    "severity_score": 10.8,
    "severity_level": "Medium",
    "score": 22,
    "num_comments": 16,
    "created_utc": 1764705926.0,
    "top_comments": []
  },
  {
    "post_id": "1pcl7eq",
    "title": "Should I stay home for community college?",
    "body": "I’m currently a senior in highschool, and I do not have the GPA to go straight to a university so i’m doing community college first. I still want that experience of being able to move out for college. I’m based in SJ california and two other friends and I are talking about moving to LA to do community college. I’ve been thinking about doing community in irvine and hopefully transfer to UC irvine. To anyone who has gone through the experience of transferring from community college to a university, what’s your opinion? I want to be able to live college life but I know it’s more reasonable to stay home for community college then when I transfer to another school then I can move out. I truly cannot makeup my mind. Any personal stories and experiences would be super helpful. ",
    "category": "Housing",
    "severity_score": 19.6,
    "severity_level": "Medium",
    "score": 12,
    "num_comments": 43,
    "created_utc": 1764711128.0,
    "top_comments": []
  },
  {
    "post_id": "1pbm5zh",
    "title": "Wanting to start over but not sure where to begin",
    "body": "Hello. I am almost 30 and finally decided I want to go back to school for law after dropping out over 10 years ago. Only issue is I used to have HORRIBLE grades and GPA due to a bad living situation I was in at the time back then and I am sure they are not even usable now. I hope to go to one of the best law colleges in my state but it requires a good gpa which I definitely don't have. I know I can get a good one now but am unsure if I am able to go to the college I want. Any advice?",
    "category": "Academic",
    "severity_score": 6.0,
    "severity_level": "Low",
    "score": 8,
    "num_comments": 11,
    "created_utc": 1764617110.0,
    "top_comments": []
  },
  {
    "post_id": "1paou8i",
    "title": "Need help finding the perfect specialization!",
    "body": "Despite being very early on my academic path, I am sure of my desire to work in the academic field, which is going great for the most part and several professor offered me assistant positions.\n\nBut my problem is that I am about to finished my bachelor degree in global humanities and cultural heritage, where it seems I fell in love with Anthropological history and theology in the medieval history: the lives of the average person living in the past, which created this huge conflict for me, as finding masters courses about global medieval anthropology is almost impossible, and I am having a hard time choosing between master's course.\n\nSo what should i do? Do I just do any masters that's related to anthropology or medieval history then I just do my Phd in the field I want? Or when do I start doing my Phd I just go around the country (I live in italy) and just do every single course that is related to this specialization I chose across several universities? Would those individual course certifications help my academic Cv? Should I go back and do something very specific like anthropology or medieval history bachelor courses to build a better basis for myself?\n\nPs. If its not obvious, I have no idea how academia works.",
    "category": "Academic",
    "severity_score": 1.0,
    "severity_level": "Low",
    "score": 5,
    "num_comments": 0,
    "created_utc": 1764525703.0,
    "top_comments": []
  },
  {
    "post_id": "1pa574a",
    "title": "Letters of Recommendation",
    "body": "I'm applying to an Exchange Program in an other university. One of the things I need to send is a letter of recommendation from one of my professors at my home university. \n\nThe issue is that I don't really have any good connection with any of my professors. We are big classes of over 300-500 where I don't particularly go to office hours or participate greatly in class that it would make my professors remember me. And sometimes, I prefer watching my classes after they were recorded instead of going to uni. I do have a few classes though where I do have really good grades. \n\nI'm wondering if anyone has been in the same situation, and what they did. \n\n",
    "category": "Academic",
    "severity_score": 2.4,
    "severity_level": "Low",
    "score": 6,
    "num_comments": 3,
    "created_utc": 1764464907.0,
    "top_comments": []
  },
  {
    "post_id": "1p94dbv",
    "title": "If you have other credits and associated certifications, can you basically just \"get an associate's\" after the fact (Paramedic certificate/Associate's program)?",
    "body": "OP title is probably confusing since the actual question is a little longer, but:\n\nI am in a Paramedic course. Paramedic can normally done one of two ways: you can pursue it with the minimum number of courses to certify, which includes a college level Anatomy and Physiology course, *or* some people go ahead and get it as an Associate's, which I am presuming just comes with a few extra electives since the regular course is already about 1,000 hours of class and clinicals collectively.\n\nI have a huge number of AP credits (unrelated to later degrees), a Bachelor's in Engineering, and got an MBA later on before pursuing this. Presumably, I have plenty of \"leftover\" credits, and if I had pursued an Associate's in Paramedicine I'd have just walked into the community college basically doing the course alone and having the rest of my incoming elective credits counted.\n\nBut as a generic college question: if the sum total of all of my courses and other credits adds up to a degree, am I basically locked out of having that degree? Like, could I basically go to a local community college with an A.S. in Paramedicine, take one course with an existing Paramedic license, and say \"already, graduated!\" Given my other degrees it doesn't *really* matter if I have the Associate's or not, but I was curious how this sort of thing works.",
    "category": "Academic",
    "severity_score": 14.0,
    "severity_level": "Medium",
    "score": 58,
    "num_comments": 6,
    "created_utc": 1764359609.0,
    "top_comments": []
  },
  {
    "post_id": "1p7f3g5",
    "title": "What happens if I don’t pay my tuition?",
    "body": "Hi everyone! I’m in a bit of a unique situation here. I took half a semester at a college in my hometown in Georgia before withdrawing from my classes due to some personal issues. I had the HOPE scholarship and only had to pay $1000 for tuition. However, whenever you withdraw, some of your HOPE money goes away and you have to repay the school. I currently owe the school just under $500, so not much. \n\nI have decided to go to a school in Oregon during the fall and will no longer be attending this school. I did not complete any courses, so I have no need for a transcript. What would have if I just don’t pay back the money? If I just won’t be able to attend this college anymore and will be unable to get my transcripts, then it sounds like it would be a waste of $500. Would there be any other consequences to not paying this money back? Thanks.",
    "category": "Financial",
    "severity_score": 41.4,
    "severity_level": "High",
    "score": 125,
    "num_comments": 41,
    "created_utc": 1764180990.0,
    "top_comments": []
  },
  {
    "post_id": "1p78jq2",
    "title": "Professor hasn't graded anything all semester",
    "body": "Currently wondering what to do regarding a situation in one of my classes. My professor has not graded anything, at all. The semester ends in 9 days, and our gradebook still has nothing in it but the auto-graded textbook quizzes (which aren't even accurate grades, because anything above an 80 becomes full credit, per the syllabus policy)\n\nOur professor has a generous retake policy because \"nobody gets all the points on the first try\" for the main assignments. The issue is, we've all done 10-20 pages of work a week. Multiply that by 30 students... and suddenly there's thousands of pages of ungraded work between AUGUST and now. I worry that I won't be able to actually re-take anything because I can't access a retake until my original work has been graded.\n\nThe whole class has asked about grades (after waiting like 5 weeks for any hint of feedback), and our prof said  they're \"working on it.\" Slight issue is they keep saying this since early October and absolutely no grades have actually been given back to us.\n\nI can't go to the department chair because I'm required to attach my name and student ID to the complaint, which is directly shared with my prof. Same with the end of course surveys (which we have to take, non-anonymously, before the course ends). Retaliation is DEFINITELY a possibility if I file a complaint. How do I make sure my final grade in this class doesn't tank at the last minute because of the lack of feedback or information?",
    "category": "Academic",
    "severity_score": 24.8,
    "severity_level": "Medium",
    "score": 68,
    "num_comments": 28,
    "created_utc": 1764165867.0,
    "top_comments": []
  },
  {
    "post_id": "1p528qa",
    "title": "If I report someone harassing me in college, will it affect my record?",
    "body": "As the question says.\n\n  \nThank you!",
    "category": "Other",
    "severity_score": 8.0,
    "severity_level": "Low",
    "score": 24,
    "num_comments": 8,
    "created_utc": 1763942830.0,
    "top_comments": []
  }
]